test.bat

curl -X POST "http://localhost:3000/nameEnquiry" --header "Content-Type: application/soap+xml" --header "x-api-key: pass123" --header "Authorization: pass123" --data '<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:isw="http://techquest.interswitchng.com/nameenquiry/"><soap:Body><isw:NameEnquiry><isw:NameEnquiryRequest><isw:CustomerID>1000018118</isw:CustomerID></isw:NameEnquiryRequest></isw:NameEnquiry></soap:Body></soap:Envelope>'